// 冒泡排序的核心思想是，前后两个位置大小相比较交换位置，比如升序排序，大的值放后面，一共进行length-1(因为是两两比较，最后一轮只剩两个值，只需要一次比较)轮比较，完成排序。

function bubleSort(arr) {
    if (!Array.isArray(arr)) throw new Error('params error: requeset Array')
    if(arr.length<2) return arr
    const len = arr.length
    for (let i = 0; i < len; i++) {
        for (let j = 0; j < len - 1 - i; j++) {
            if (arr[j]>arr[j+1]) {
                [arr[j], arr[j+1]] = [arr[j+1], arr[j]]
            }
        }
    }
}

// const arr0 = [123, 1, 41, 41, 423, 51, 4, 43, 41, 2536, 2, 432, 1626, 1, 645, 2, 62, 432]
// const arr = [5, 7575, 2, 6, 5, 23,432 , 57, 3, 8, 6,31231, 1432242, 523214, 543, 1, 4, 543, 645, 7575, 2, 6, 5, 23,432 , 57, 3, 8, 6,92,243 , 54, 53, 47, 98, 9, 7, 346,423 , 9, 7,31231, 1432242, 523214, 543, 1, 4, 543, 645, 7575, 2, 6, 5, 23,432 , 57, 3, 8, 6,31231, 1432242, 523214, 543, 1, 4, 543, 645, 7575, 2, 6, 5, 23,432 , 57, 3, 8, 6,92,243 , 54, 53, 47, 98, 9, 7, 346,423 , 9, 7, 43, 5, 98, 456, 34, -24, 23, 423, 42, 423, 0, -234, 4234211, 234512, 534235423, 3]

// bubleSort(arr)
// console.log(arr) 